Assignment on Statistics
 An Institution wishes to find out their student’s ability in
mathematics, reading and writing skills.

In [1]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv('C:/Users/ADMIN/Desktop/DSA/Assesments/Students_Performance.csv')

In [6]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

a.Find out how many males and females participated in the test.

In [9]:
df.groupby("gender").size()

gender
female    518
male      482
dtype: int64

b.What do you think about the students' parental level of 
education?

In [34]:
sum=df.groupby("parental level of education").size().sum()
df.groupby("parental level of education").size().apply(lambda x:
                                                100 * x / float(sum))

parental level of education
associate's degree    22.2
bachelor's degree     11.8
high school           19.6
master's degree        5.9
some college          22.6
some high school      17.9
dtype: float64

Showing the percentage of parents belonging to differnetlevels of education

c. Who scores the most on average for math, reading and 
writing based on
i. Genderse

In [36]:
df.groupby("gender").agg({'math score':'mean','reading score':'mean','writing score':'mean'})

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

Observations:For math Males scored higher tha Females based on average marks where as for reading and writing Females scored over Males based on average maarks.

c. Who scores the most on average for math, reading and writing based on
ii. Test preparation courserse

In [37]:
df.groupby("test preparation course").agg({'math score':'mean','reading score':'mean','writing score':'mean'})

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

Observations:For Math,Reading and Writing,those who have completed the test preparation course has scored more based on average marks

d. What do you think about the scoring variation for math, reading and writing based on
i. Gender

In [66]:
df.groupby("gender").agg({'math score':['std','min','max'],'reading score':['std','min','max'],'writing score':['std','min','max']})

       math score          reading score          writing score
              std min  max           std min  max           std min  max
gender
female  16.029928   0  100     14.411018  17  100     14.844842  10  100
male    14.556411  27  100     14.149594  23  100     14.227225  15  100

Showing the standard deviation, min and max based on Gender

d. What do you think about the scoring variation for math, reading and writing based on

ii. Test preparation course

In [67]:
df.groupby("test preparation course").agg({'math score':['std','min','max'],'reading score':['std','min','max'],'writing score':['std','min','max']})

                        math score          reading score           \
                               std min  max           std min  max
test preparation course
completed                14.521847  23  100     13.537572  37  100
none                     15.705689   0  100     14.608896  17  100

                        writing score
                                  std min  max
test preparation course
completed                   13.236412  36  100
none                        15.041667  10  100

Showing the standard deviation, min and max based on test preparation course

The management needs your help to give bonus points to the top 25% of students based on their math score, so how will you help the management to achieve this.

In [54]:
df[df['math score']>=(df['math score'].quantile(q=.75)) ] #Calulating 75% quantile for math score and taking all scores greater than equal to it

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
414,female,group A,high school,free/reduced,completed,77,88,85
415,female,group B,master's degree,free/reduced,completed,77,97,94
416,female,group B,bachelor's degree,free/reduced,none,77,85,87
417,female,group B,master's degree,standard,none,77,90,84
418,female,group B,high school,standard,completed,77,82,89
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [ ]:
####Case Study on Testing of Hypothesis

In [56]:
import scipy.stats as stats
import statistics
sa=pd.read_csv('C:/Users/ADMIN/Desktop/DSA/Assesments/Sales_add.csv')
sa.rename(columns = {'Sales_before_digital_add(in $)':'Sales_before', 'Sales_After_digital_add(in $)':'Sales_After'
                              }, inplace = True)
sa.head()

     Month      Region      Manager  Sales_before  Sales_After
0  Month-1  Region - A  Manager - A        132921       270390
1  Month-2  Region - A  Manager - C        149559       223334
2  Month-3  Region - B  Manager - A        146278       244243
3  Month-4  Region - B  Manager - B        152167       231808
4  Month-5  Region - C  Manager - B        159525       258402

1.####The company wishes to clarify whether there is any  increase in sales after stepping into digital marketing

In [ ]:
#H0:There is no increase in sales after digital marketing
#Ha;There is an increase in sales after digital marketing

In [ ]:
#The sales before digital marketing is taken as population mean and sales afrer taken as sample mean,sample std taken as std afrer digital marketing

In [57]:
pop_mean=sa['Sales_before'].mean()
sample_mean=statistics.mean(sa['Sales_After'])
sample_std=statistics.stdev(sa['Sales_After'])
sample_size=len(sa.index)
data=np.array(sa['Sales_After'])
#data=np.random.normal(loc=sample_mean,scale=sample_std,size=sample_size) ## not using the same as already sample data is there

In [58]:
t_stat,pvalue=stats.ttest_1samp(data,pop_mean,alternative='greater') #sample data is taken as the given data
print(t_stat,pvalue)

15.028066221386988 5.189045779399668e-13

In [59]:
#Comaprison using t-value
#from ct-value table for alpha 0.05 critical value for dof=21 is 1.721
critical_value=1.721
if t_stat>critical_value:
    print("Reject Null Hypothesis:There is an increase in sales after digital marketing")
else:
    print("Accept  Null Hypothesis:There is no increase in sales after digital marketing")

Reject Null Hypothesis:There is an increase in sales after digital marketing

In [60]:
#Comaprison using p-value
alpha=.05
if pvalue<alpha:
    print("Reject Null Hypothesis:There is an increase in sales after digital marketing")
else:
    print("Accept  Null Hypothesis:There is no increase in sales after digital marketing")

Reject Null Hypothesis:There is an increase in sales after digital marketing

In [ ]:
2.####The company wishes to check whether there is any dependency between the features “Region” and “Manager”.

In [62]:
#H0 There is no dependency between Region and Manager.
#Ha There is a dependency between Region and Manager.
observed=np.array((sa.groupby(["Region","Manager"]).count())['Month']).reshape((3,3))  ##### getting the output og groupby as an array 
                                                                                       ##### ([[4,3,3],[4,1,2],[1,3,1]]) as contingency table
chi2_stat,pvalue,dof,expected=stats.chi2_contingency(observed)
print(chi2_stat,pvalue,dof,expected)

3.050566893424036 0.5493991051158094 4 [[4.09090909 3.18181818 2.72727273]
 [2.86363636 2.22727273 1.90909091]
 [2.04545455 1.59090909 1.36363636]]

In [63]:
#Comaprison using chi-square critical value
#from chi-squared table for alpha 0.05 critical value for dof=4 is 9.488
critical_value=9.488
if chi2_stat>critical_value:
    print("Reject Null Hypothesis:There is a dependency between Region and Manager")
else:
    print("Accept  Null Hypothesis:There is no dependency between Region and Manager")

Accept  Null Hypothesis:There is no dependency between Region and Manager

In [64]:
#Comaprison using p-value
alpha=.05
if pvalue<alpha:
    print("Reject Null Hypothesis:There is a dependency between Region and Manager")
else:
    print("Accept  Null Hypothesis:There is no dependency between Region and Manager")

Accept  Null Hypothesis:There is no dependency between Region and Manager